In [1]:
#Imports generales
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import MetaData, types 
from sqlalchemy import Table, Column, ForeignKey
#Constantes
dbname = "tp3"

In [17]:
from pandas import DataFrame

#### Crear el "engine" pasando la dirección de la db

In [3]:
#Crear la BD para el tp3. 
from psycopg2 import connect
from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT

con = None
con = connect(user="postgres",host="localhost",password="rodrigoh")

con.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT)
cur = con.cursor()
cur.execute('CREATE DATABASE '+ dbname)
cur.close()
con.close()

In [2]:
engine = create_engine('postgresql://postgres:rodrigoh@localhost:5432/'+dbname)
engine

Engine(postgresql://postgres:***@localhost:5432/tp3)

In [4]:
metadata = MetaData()

In [14]:


#TIME (TimeStamp, Date, Year,)
time = Table('time', metadata,
    Column('Id', types.Integer, primary_key=True),                     
    Column('TimeStamp', types.TIMESTAMP),         
    Column('Year', types.Integer, primary_key=False),
    Column('Date', types.Date, nullable=False),
 )

#CLASS (Code, Name, Region)
tipo_vino = Table('class', metadata,
    Column('Code', types.Integer, primary_key=True),         
    Column('Name', types.String(length=50)),
    Column('Region', types.String(length=50)),
 )

#CUSTOMER (Code, Name, Address, Phone, BDay, Gender)
customer = Table('customer', metadata,
    Column('Code', types.Integer, primary_key=True),         
    Column('Name', types.String(length=50)),
    Column('Address', types.String(length=50)),
    Column('Phone', types.String(length=50)),
    Column('BDay', types.String(length=50)),
    # Hombre = True, Mujer = False
    Column('Gender', types.Boolean),

 )


#WINE (Code, Name, Type, Vintage, BottlePrice, CasePrice, Class)

wine = Table('wine', metadata,
    Column('Code', types.Integer, primary_key=True),         
    Column('Name', types.String(length=50)),
    Column('Type', types.String(length=50)),
    Column('Vintage', types.Integer),
    Column('BottlePrice', types.Float),
    Column('CasePrice', types.Float),
    Column('Class',types.Integer, ForeignKey("class.Code")),                  
 )

#ORDER (Code,Customer, Wine, Time, nrBottles, nrCases)
orden = Table('order', metadata,
    Column('Code',types.Integer, primary_key=True),         
    Column('Id_customer',types.Integer, ForeignKey("customer.Code")),         
    Column('Id_wine',  types.Integer, ForeignKey("wine.Code") ),
    Column('Id_time',  types.Integer,ForeignKey("time.Id")),
    Column('nrBottles', types.Integer),
    Column('nrCases', types.Integer),          
 )

#VENTAS (ID_WINE,ID_ORDER,PRECIO_ORDEN)
ventas = Table('ventas', metadata,
    Column('Id_venta', types.Integer, primary_key=True),         
    Column('Id_order', types.Integer,ForeignKey("order.Code")),
    Column('Id_wine', types.Integer, ForeignKey("wine.Code")),
    Column('Precio_orden', types.Float)
 )

In [37]:
metadata.create_all(engine)

sqlalchemy.sql.schema.Table

In [15]:
#Cargar datos de prueba
import numpy as np
import dateutil.parser as dateparser

#Extraer el año del date para que coincida con campo Year
df_time = pd.read_csv("dataTp3/Time.csv")
df_time["Year"] = df_time["TimeStamp"].apply(lambda x: dateparser.parse(x).year)
df_time["Date"] = df_time["TimeStamp"].apply(lambda x: dateparser.parse(x).date())
#Cargar dataframes en postgresql
time = df_time.to_sql('time', engine, index=None,if_exists='append')
#df_time

In [16]:
df_customer= pd.read_csv("dataTp3/Customer.csv")
customer = df_customer.to_sql('customer', engine, index=None,if_exists='append')
df_class= pd.read_csv("dataTp3/Class.csv")
classes = df_class.to_sql('class', engine, index=None,if_exists='append')
df_wine= pd.read_csv("dataTp3/Wine.csv")
wine = df_wine.to_sql('wine', engine, index=None,if_exists='append')
df_order= pd.read_csv("dataTp3/Order.csv")
order = df_order.to_sql('order', engine, index=None,if_exists='append')
df_ventas= pd.read_csv("dataTp3/Ventas.csv")
ventas = df_ventas.to_sql('ventas', engine, index=None,if_exists='append')

In [23]:
#Calcular porcentajes de tipos de vinos mas vendidos
#
#FALTA TERMINAR!!!
#
from sqlalchemy.sql import select,and_, or_, not_

#select([users, addresses]).where(users.c.id == addresses.c.user_id)
#select.group_by()
def calcular_porcentaje_ventas(engine,anio):
    print "1"
    conn = engine.connect()
    metadata = MetaData()
    metadata.reflect(bind=conn)
    ventas=metadata.tables.get("ventas")
    orden=metadata.tables.get("order")
    wine=metadata.tables.get("wine")
    time=metadata.tables.get("time")
    clase=metadata.tables.get("class")
    consulta = select([clase.c.Name,orden.c.nrBottles*orden.c.nrCases]).where(
            ventas.c.Id_order == orden.c.Code and (orden.c.Id_time == time.c.Id_time and (time.c.Year == anio))
                    and (ventas.c.Id_wine == wine.c.Code and ( wine.c.Class == clase.c.Code ))
            )
    print "2"
    result = conn.execute(consulta).fetchall()
    #Se transforma en un data frame el resultado de la consulta.
    df = DataFrame(result)
    print df
    #for row in result:
    #    print(row)

calcular_porcentaje_ventas(engine,2005)
    
#Temporada que los vinos de tipo X se venden mas?


#Cliente que ha realizado mas compras

1
2
                 0       1
0              Day  344877
1             Lane  344877
2             Hart  344877
3             King  344877
4            Reyes  344877
5          Wheeler  344877
6           Holmes  344877
7             King  344877
8             Reid  344877
9            Brown  344877
10          Bishop  344877
11           Riley  344877
12          Taylor  344877
13           Ortiz  344877
14        Johnston  344877
15      Richardson  344877
16       Carpenter  344877
17            Reed  344877
18        Franklin  344877
19           James  344877
20            King  344877
21           James  344877
22            Hart  344877
23         Ramirez  344877
24        Anderson  344877
25         Elliott  344877
26            Reed  344877
27         Simmons  344877
28         Sanchez  344877
29          Romero  344877
...            ...     ...
999970        Ross  526240
999971     Bradley  526240
999972  Montgomery  526240
999973    Gonzalez  526240
999974     Morales  526240
999975      Wright  526240
999976      Larson  526240
999977  Cunningham  526240
999978     Edwards  526240
999979    Franklin  526240
999980     Morales  526240
999981      Jordan  526240
999982       Scott  526240
999983      Powell  526240
999984     Frazier  526240
999985      Harris  526240
999986    Johnston  526240
999987      Austin  526240
999988       Burns  526240
999989     Nichols  526240
999990        Gray  526240
999991       Henry  526240
999992        Rice  526240
999993     Johnson  526240
999994      Arnold  526240
999995        Shaw  526240
999996      Morgan  526240
999997       Berry  526240
999998         Day  526240
999999     Roberts  526240

[1000000 rows x 2 columns]

In [6]:
print "asasaaaaa"

asasaaaaa

In [78]:
df_class

     Code        Name                            Region
0       1         Day                        Kazakhstan
1       2        Lane                             China
2       3        Hart                         Indonesia
3       4        King                         Indonesia
4       5       Reyes                          Portugal
5       6     Wheeler                            Russia
6       7      Holmes                             China
7       8        King                             China
8       9        Reid                          Pakistan
9      10       Brown                              Mali
10     11      Bishop                           Germany
11     12       Riley                          Slovenia
12     13      Taylor                            Sweden
13     14       Ortiz                            Brazil
14     15    Johnston                            France
15     16  Richardson                            France
16     17   Carpenter                             China
17     18        Reed                         Indonesia
18     19    Franklin                         Indonesia
19     20       James                          Dominica
20     21        King                             Syria
21     22       James                            Poland
22     23        Hart                       Philippines
23     24     Ramirez                            Bhutan
24     25    Anderson                       Philippines
25     26     Elliott                             China
26     27        Reed                            France
27     28     Simmons                            Russia
28     29     Sanchez                            Mexico
29     30      Romero                            Sweden
..    ...         ...                               ...
970   971        Ross                            Greece
971   972     Bradley                          Thailand
972   973  Montgomery                             China
973   974    Gonzalez                            Russia
974   975     Morales                            Russia
975   976      Wright                             China
976   977      Larson                          Mongolia
977   978  Cunningham  Democratic Republic of the Congo
978   979     Edwards                             China
979   980    Franklin                            Russia
980   981     Morales                         Indonesia
981   982      Jordan                         Indonesia
982   983       Scott                             China
983   984      Powell                            Brazil
984   985     Frazier                    Czech Republic
985   986      Harris                            Russia
986   987    Johnston                         Guatemala
987   988      Austin                            Poland
988   989       Burns                           Namibia
989   990     Nichols                           Finland
990   991        Gray                         Indonesia
991   992       Henry                            France
992   993        Rice                             China
993   994     Johnson                           Nigeria
994   995      Arnold                          Malaysia
995   996        Shaw                            France
996   997      Morgan                             Syria
997   998       Berry                         Indonesia
998   999         Day                              Peru
999  1000     Roberts                           Ukraine

[1000 rows x 3 columns]

#### Hacer la query especificando el "engine" que se desea usar

In [14]:
df_customer = pd.read_sql_query('select * from "Customer"',con=engine)

In [15]:
df_customer.to_json('/tmp/test.json')

In [16]:
json_df  = pd.read_json('/tmp/test.json')
json_df

        Birthday  CustomerCode Gender
0   971136000000             1      F
1  1421020800000             2      M
2  1389312000000             3      F
3  1294617600000             4      F

In [17]:
json_df['Birthday'] = pd.to_datetime(json_df['Birthday'], unit='ns')
json_df

                    Birthday  CustomerCode Gender
0 1970-01-01 00:16:11.136000             1      F
1 1970-01-01 00:23:41.020800             2      M
2 1970-01-01 00:23:09.312000             3      F
3 1970-01-01 00:21:34.617600             4      F

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 3 columns):
CustomerCode    4 non-null int64
Birthday        4 non-null object
Gender          4 non-null object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [5]:
df.describe()

       CustomerCode
count      4.000000
mean       2.500000
std        1.290994
min        1.000000
25%        1.750000
50%        2.500000
75%        3.250000
max        4.000000

Link a [Pandas NB](Starting%20with%20pandas.ipynb) para ver join, merge, append, etc

#### Agregando un nuevo registro a nuestra tabla "Customer" con pandas

In [25]:
new_df = pd.DataFrame([[4, pd.datetime(2011, 1, 10), 'F']], columns=df.columns)
new_df

   CustomerCode   Birthday Gender
0             4 2011-01-10      F

In [26]:
new_df.to_sql('Customer', engine, if_exists='append', index=None)

#### Agregando una nueva tabla a nuestra db desde pandas

In [29]:
new_table = pd.DataFrame([], columns=['WineCode', 'Type', 'Vintage'])
new_table

Empty DataFrame
Columns: [WineCode, Type, Vintage]
Index: []

In [30]:
new_table.to_sql('Wine', engine, index=None)

#### Ahora hagamos lo mismo con sqlalchemy

In [40]:
from sqlalchemy import MetaData, types
from sqlalchemy import Table, Column

In [35]:
metadata = MetaData()

In [41]:
time = Table('Time', metadata,
    Column('TimeCode', types.Integer, primary_key=True),
    Column('Date', types.DateTime, nullable=False),
 )

In [42]:
metadata.create_all(engine)

### Agregando elementos a Wine con pandas

In [10]:
data = [[1, 'White', 2000],
        [2, 'red', 2015],
        [3, 'rose', 2014]]

In [11]:
new_df = pd.DataFrame(data, columns=df_wine.columns)

In [12]:
new_df.to_sql('Wine', engine, if_exists='append', index=None)

In [13]:
df_wine = pd.read_sql_query('select * from "Wine"',con=engine)
df_wine

  WineCode   Type Vintage
0        1  White    2000
1        2    red    2015
2        3   rose    2014

In [32]:
data = [[1, 'White', pd.datetime(2000, 10, 10)],
        [2, 'red', pd.datetime(2010, 9, 9)],
        [3, 'rose', pd.datetime(2011, 9, 9)]]

In [36]:
new_df = pd.DataFrame(data, columns=df_wine.columns)
new_df['Vintage']

0   2000-10-10
1   2010-09-09
2   2011-09-09
Name: Vintage, dtype: datetime64[ns]

In [46]:
new_df.to_json('/tmp/lero.json', date_unit='ns')

In [47]:
json_demo = pd.read_json('/tmp/lero.json')
jso

    Type              Vintage  WineCode
0  White   971136000000000000         1
1    red  1283990400000000000         2
2   rose  1315526400000000000         3

In [52]:
new_df

   WineCode   Type    Vintage
0         1  White 2000-10-10
1         2    red 2010-09-09
2         3   rose 2011-09-09

In [48]:
json_demo['Vintage'] = pd.to_datetime(json_demo['Vintage'], unit='ns')

In [49]:
json_demo

    Type    Vintage  WineCode
0  White 2000-10-10         1
1    red 2010-09-09         2
2   rose 2011-09-09         3

In [55]:
new_df

   WineCode   Type    Vintage
0         1  White 2000-10-10
1         2    red 2010-09-09
2         3   rose 2011-09-09

In [65]:
json_demo.columns.values

array([u'Type', u'Vintage', u'WineCode'], dtype=object)

In [66]:
json_demo.values

array([[u'White', Timestamp('2000-10-10 00:00:00'), 1],
       [u'red', Timestamp('2010-09-09 00:00:00'), 2],
       [u'rose', Timestamp('2011-09-09 00:00:00'), 3]], dtype=object)

In [67]:
pd.merge(json_demo, new_df, on=list(json_demo.columns.values), how='outer')

    Type    Vintage  WineCode
0  White 2000-10-10         1
1    red 2010-09-09         2
2   rose 2011-09-09         3

In [82]:
pd.Series?

In [83]:
score = pd.Series([10, 9, 8], name='score')
score

0    10
1     9
2     8
Name: score, dtype: int64

In [96]:
out = pd.concat([json_demo, score], axis=1)
new_row = pd.DataFrame([[4, 'espumeante',pd.datetime(2000,2,2)]], columns=new_df.columns)

In [101]:
append_df = new_df.append(new_row)

In [105]:
append_df.to_sql('Wine', engine, if_exists='append', index=None)